# ResultType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidCurveIntersectionOptions..::..ResultType Property
SolidCurveIntersectionOptions Class See Also
---
The type of results expected by the calculation. The default is CurveSegmentsInside.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SolidCurveIntersectionMode ResultType { get; set; }
```

Visual Basic
---
```text
Public Property ResultType As SolidCurveIntersectionMode
	Get
	Set
```

Visual C++
---
```text
public:
property SolidCurveIntersectionMode ResultType {
	SolidCurveIntersectionMode get ();
	void set (SolidCurveIntersectionMode value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace